*** Home
También vamos a llegar el seguimiento de los modificaciones realizadas en el fichero $HOME/.bash.
Los pérmisos asignado a este fichero son los siguientes
#+BEGIN_SRC shell
ls -l -a ~ | grep .bashrc 
#+END_SRC

#+RESULTS:
| -rwxr-xr-x | 1 | erik | erik | 3597 | abr |  2 | 02:33 | .bashrc              |    |                                                                                          |
| -rw-r--r-- | 1 | erik | erik | 3526 | mar | 20 | 13:16 | .bashrc~             |    |                                                                                          |
| lrwxrwxrwx | 1 | erik | erik |   88 | abr |  2 | 02:15 | .bashrc_ev_variables | -> | /home/erik/Documentos/Proyectos/configuraciones/home/configs/default/.bash_env_variables |

Como se puede observar necesitamos es necesario emplear permisos de ejecución.
Lo movemos a nuestro directorio de configuraciones por defecto y creamos el soft link como de constumbre.
Vamos crear cuatro nuevos ficheros y los llamaremos : 
- .bash_aliases para crear nuevos alias
- .bash_funciones para crear funciones personalizadas.
- .bash_git variable,funciones y alias propias de git
- .bash_env_variables variables de ambiente personales.
Estos ficheros se cargan desde la configuración principal que en princio no deberíamos tocar.
Cualquier configuración se agregara en alguno de los ficheros anteriores o crearemos un fichero 
que se ajuste mejor a nuestras necesidades.
Al copiar mover el fichero ~/.bashrc desde su directorio original al directorio de seguimineto he visto
que se pierden ciertos pérmisos debemos asegurarnos que el usuario propietario pueda ejecutar dicho fichero.
Los permisos del resto de ficheros no es necesario cambiarlos.


#+begin_src shell
ln -s -f /home/erik/Documentos/Proyectos/configuraciones/home/configs/default/.bashrc ~/.bashrc                                                                                     
ln -s -f /home/erik/Documentos/Proyectos/configuraciones/home/configs/default/.bash_env_variables /home/erik/.bash_ev_variables                                                     
ln -s -f /home/erik/Documentos/Proyectos/configuraciones/home/configs/default/.bash_env_variables  ~/.bash_env_variables                                                            
ln -s -f /home/erik/Documentos/Proyectos/configuraciones/home/configs/default/.bash_aliases  ~/.bash_aliases 
#+end_src





